app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("created_at", "last_request_at", "crypted_password", "updated_at", "perishable_token", "current_login_ip", "county", "password_salt", "current_login_at", "is_admin", "persistence_token", "login_count", "last_name", "last_login_ip", "login", "last_login_at", "referral", "has_passed_quiz", "first_name", "email") VALUES('2010-03-24 15:21:29', '2010-03-24 15:21:29', '78b84de1d1e6b3fe55068c8699064962669aa8ae1ef621ceb5a617c6fc21fdf36f31cab583ab3425f56e5e33b02723fe7eabb606ca75fda57864872f7f8c90ca', '2010-03-24 15:21:29', 'VI18QJ0cM2ITifp_r_Us', '127.0.0.1', 'sussex', 'oeyh6nnglKAunvlGGFCc', '2010-03-24 15:21:28', 'f', '9c78687574fd8e17758d233e7746b0fa199d72458154d7c5253e310e9c612b58eced87a990d2781a365db0903c8937174e2e2e391a431bbb93ed15bbb05a72bb', 1, 'Grubb', NULL, 'testboy', NULL, 'dev', 'f', 'John', 'testboy@gmail.com')

  def update
    @user = @current_user # makes our views "cleaner" and more consistent
    if @user.update_attributes(params[:user])
---
UPDATE "users" SET "updated_at" = '2010-03-21 20:10:14', "last_request_at" = '2010-03-21 20:10:14' WHERE "id" = 1